IDENTIFICATION DIVISION.
PROGRAM-ID. VAR-DEMO.

DATA DIVISION.
WORKING-STORAGE SECTION.
   01 word-with-numbers PIC x(30) VALUE "HELLO, WORLD 000".

PROCEDURE DIVISION.
       DISPLAY word-with-numbers.
       STOP RUN.
